[
{"title": "Software Engineer - Web", "company": "Zoom", "location": "San Jose, CA", "description": "Zoom is an award-winning workplace. We have been recognized by Comparably as #1 CEO, Company Happiness, Benefits, Compensation, Diversity, and more! Not to mention we’ve been awarded by Glassdoor as the 2nd Best US workplace &amp; Best Large Company US CEO in 2018, Wealthfront, and Business Insider. Our culture focuses on delivering happiness, our commitment to transparency, and the tangible benefits we provide our employees and our customers. Java Full Stack Developer Responsibilities Design, development, and testing of features/functions delivered via applications and services Working with operations teams to ensure your applications and services are highly available and reliable Hands on software development for product that will perform at scale, be supportable, and be extensible. Requirements BS degree or equivalent in a directly related discipline (CS, Eng, etc.). Have prior internship or related work experience. (3+ years work experience) Have successfully built, deployed, and supported an enterprise-scale web application in the cloud. Ideally have full-stack experience, with expertise in at least one layer. Hands-on software development experience in Java. Hands-on software development experience in JavaScript with a modern MVC framework. Cognizant of modern database/storage technologies Understands complex workflows and develop and validate innovative solutions to solve difficult problems. Experience with multi-threaded programming. Experience developing application on Linux. Preferred Qualifications Experience solving internet scale problems Experience working on cloud (on-demand) software Excellent verbal and written communication skill Cloud experience"},
{"title": "Software Development Engineer I - Commerce Engineering", "company": "Twitch", "location": "San Francisco, CA", "description": "About Us Launched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions. We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams. Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions. We’re always live at Twitch. Stay up to date on all things Twitch on LinkedIn , Twitter and on our Blog . About The Role Twitch is building the future of interactive entertainment, and our Commerce Engineering team is preparing to scale to work on important product projects to support Bits, Subscriptions, Affiliates, Twitch Prime, and many great social interaction features. As an important member of the engineering team, you will design and build solutions that affect millions of users and broadcasters. You will provide technical leadership, architectural guidance, and mentorship across multiple teams and work closely with other teams to design the next generation of Payments offerings, and be a main reason for the team's technical and operational excellence. You Will Work with leads and other engineers to design, develop commerce/payments platform and services Customer-focused to contribute to project deliveries Work with other teams to clarify product requirements Improve engineering process and tools to improve velocity and productivity Participate in design and code reviews You Have: Minimum of Bachelor's degree in Computer Science or prior relevant engineering experiences Experience with data structures, algorithms, data modeling and schema design 1+ years as an software engineer Proficient experience level in one or more of the following language: Go, Ruby, Java , C++ Familiar with AWS ecosystem Bonus Points Previous experience in commerce/payments domain Twitch user, broadcaster, or partner or experience in the gaming industry Perks Medical, Dental, Vision &amp; Disability Insurance 401(k) , Maternity &amp; Parental Leave Flexible PTO Commuter Benefits Amazon Employee Discount Monthly Contribution &amp; Discounts for Wellness Related Activities &amp; Programs (e.g., gym memberships, off-site massages , etc. ), Breakfast, Lunch &amp; Dinner Served Daily Free Snacks &amp; Beverages Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."},
{"title": "Software Engineer - Quip", "company": "Quip", "location": "San Francisco, CA", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details Are you interested in working on the next generation of collaboration software? Our goal at Quip is to build a new class of productivity tool that every person at every company enjoys using every single day. What we’re looking for: a software engineering generalist who’s passionate and cares deeply about product development. At Quip, our engineers are always learning new things — we all work cross-platform and full-stack. We pride ourselves on writing high-quality code and maintainable systems that make our lives easier, across Javascript, C++, Python, Java, and Objective-C. Every engineer works on exciting, meaningful projects that impact our technical and product strategy. We work closely with Product Managers and Designers to define new features, and help map the future of Quip. We’re building the next generation of products leveraging frameworks, such as React, and tackling complex problems related to large-scale backend infrastructure and mobile platforms. We’re building a team of talented, thoughtful people who will work together to build an enduring company that will change the way teams work together. What We Look For Excellent software engineering talent Knowledge of Python, Objective-C, Javascript, SQL, C++, Java, or the ability to learn them quickly Experience with web applications, databases, distributed systems, or mobile development is a plus Passion for learning and working with others to improve yourself, the team, the product, the company What You'll Do Building consumer-level applications (mobile, web, desktop) for enterprise - with a focus on design and usability Solving complex challenges such as performance, scalability, and security Growing and scaling our product and servers, applying the latest technologies and best practices Mentoring your peers or be mentored by your peers in various in-house mentorship Learn to make great and not so great puns Accommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org. Salesforce welcomes all. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records."},
{"title": "Software Engineer", "company": "Microsoft", "location": "Redmond, WA", "description": "The Internet of Things (IoT) is fast becoming one of the hottest technology trends as new business and consumer scenarios are unlocked that rely on insights and control from devices of all sizes. In addition to device innovation that allows nearly ubiquitous reach and form factors the cloud has enabled new scenarios where it is routine to process petabytes of data and use advanced analytics, like machine learning, to gain new insights. Microsoft Azure is an industry leader in IoT with the introduction of Azure IoT. Azure IoT is a comprehensive solution that spans devices, device management, gateways, advanced analytics, and command &amp; control functionality. Azure IoT is already in production with millions of devices and trillions of messages a month already flowing. The Azure IoT Central team is looking for a full stack developer that will work on IoT Central, a SaaS offering that aims to reduce the complexity of connecting and managing IoT devices. As a member of the team you will be expected to work across the team with PM, Infrastructure, UX designers and other backend Microservice teams to produce world class, super performant service APIs, as well as frontend UI components end to end. Azure IoT Central is built on a full OSS stack and therefore you will be exposed to technologies such as Docker, Kubernetes, as well as a full range of Azure services such as CosmosDB, Service Bus, EventHub, etc. This is a truly unique opportunity to work on a relatively new product in IoT, use cutting edge technology and deliver features based on industry focused scenarios. Responsibilities Responsibilities: This position has direct and clear impact on our product and our customers. The scope of responsibilities includes: Design and implement highly efficient APIs and microservice. Participate in design inspections and code reviews with team members. Implementing new features, increasing reliability, improving observability, improving security, and automating where possible. Building high scale distributed systems that are highly available, performant, and secure. Measuring and monitoring application and infrastructure health. Investigate customer issues based on Q&amp;A with them about their issues, acquired logs of their failed operation, or local reproduced samples. Qualifications Qualifications: 2 + years of experience in software development Bachelor’s degree in Computer Science or equivalent industry experience Experience developing APIs used by others Successfully delivered enterprise level applications and cloud services to customers Good written and oral communication skills Preferred Qualifications Experience with Docker, K8s, NodeJS, Typescript and .NET Core Development experience in Linux is a plus Deep understanding of distributed systems principles Experience developing distributed data processing pipelines Experience developing IaaS / PaaS services for a Cloud Platform Deep understanding of threats, vulnerabilities, and writing secure code Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work. xAzureIoTSolutionsx xAzureIoTSWEx xAzureIoTx"},
{"title": "Software Engineer", "company": "Pizza Hut", "location": "Plano, TX", "description": "Software Engineer Description: At Pizza Hut, we want to make it easier to get better pizza and we're putting digital at our core for this. We have recently created a startup: Pizza Hut Digital Ventures, committed to building and implementing innovative digital solutions, empowering our customers to have an exceptional experience. From building a world-class platform and a clean mobile experience, we are pushing the boundaries to ensure we remain forward-thinking and ahead of the curve. With our adoption of the best technologies and customer-first approach in design, we are on the cusp of building something transformational for the entire delivery sector. We're looking for passionate Software Engineers with a proven track record of delivering challenging software projects who would thrive in a forward-thinking, progressive, digital company. We create both rapid prototypes, usually in 2 to 3 weeks, as well as full-scale applications typically within 2 to 3 months, by working collaboratively and iteratively through design and development to deliver fully functioning web-based and mobile applications that meet business goals. You will contribute to the architecture across the technology stack, from database to native apps. Our development teams are small, flexible and employ agile methodologies to quickly provide our consultants with the solutions they need. We combine the latest open source technologies together with traditional Enterprise software products. Responsibilities Work as part of a highly collaborative, cross-functional development team following continuous delivery practices and building highly performant code. Develop prototypes quickly but deliver production code that can scale. Be involved in a full spectrum of development, including new features and new applications but also tools to support experimentation, localization and customization. Be creative and experiment with new solutions but be pragmatic and committed to code optimization, maintainability, and quality. Work with product owners and designers to prioritize and hone features. Optimize web applications for maximum speed and scale. Minimum Requirements Bachelor's degree 3+ years of JavaScript experience (front- or back-end) 3+ years of NodeJS work experience 2+ years of ReactJS/ VueJS work experience 2+ years of HTML and CSS work experience 1+ year(s) of experience with AWS (SNS, SQS, ECS or Lambda experience preferred) Ability to read, write, and speak English fluently Optional Requirements (nice To Have) Experience with Docker E-commerce experience"},
{"title": "Software Engineer", "company": "iHeartMedia", "location": "Austin, TX", "description": "Current employees and contingent workers click here to apply and search by the Job Posting Title. iHeartMedia Job Summary iHeartMedia is the No. 1 all-in-one digital audio service with over a billion downloads; we reached our first 20 million registered users faster than any digital service in Internet history and reached 110 million registered users faster than any other radio or digital music service and even faster than Facebook. Our areas of operations include radio broadcasting, online, mobile, digital and social media, live concerts and events, syndication, music research services and independent media representation. iHeartMedia is looking for a talented Software Engineer to work directly with our Engineering &amp; Systems Integration team on software development and enhancement to support broadcast data services initiatives. This position requires using highly structured programming techniques in writing software code, and disciplined documentation skills. Must be able to communicate and collaborate effectively with the Scrum Team to clearly provide progress updates, roadblocks, and offer suggestions &amp; solutions. The successful candidate needs to be able to investigate problems, identify robust solutions quickly and work well in a fast-paced team environment. Responsibilities The Software Developer will be responsible for automating software engineering processes. Design and script automation frameworks which take software from development to production in a fully automated way. Ensure problem-free deployments to production, without any interruptions to business processes. Build monitoring solutions and ensure prompt alerting. Lead incident and problem resolution activities to minimize impacts on availability and performance. Contribute data to enterprise dashboards and ensure visibility of software development progress across the enterprise. Provide automation thought leadership in Scrum teams and optimize technical decisions to maximize scrum team velocity. Integrate standardization solutions in the software development life cycle (SDLC). Establish a data-driven culture and a repeatable, structured and disciplined approach to the full systems life cycle. Keep abreast of industry standards and newest DevOps methodologies and tools. Create a data-driven culture with high standards of operational excellence and continuous improvement. Qualifications 5+ years of experience in enterprise software development in Java J2EE 5+ years of experience delivering automation solutions in an Agile software organization. 5+ years of experience in the use of professional software engineering best practices for the full software development life cycle (SDLC), including coding standards, code reviews, source control management, build processes, testing, and operations Recent development experience on cloud infrastructures and microservices, preferably AWS. Essential skills, extensive enterprise level development experience with experience in the following technologies and languages: Java, JavaScript, JQuery, React, Spring Frameworks (i.e. Springboot), Akka, Maven, Junit, Chef, Docker, Jenkins Experience with data manipulation and transformation Experience with working with databases from the development side. Dynamo DB, ElasticSearch, MySQL and PostgreSQL experience preferred Broad experience with HTTP, FTP, XML, Client/Server protocols and server virtualization Ability to work with external engineers, and provide clear documentation, APIs, and sample code Extensive experience managing sprints in JIRA Experience with Technical Standards, Documentation Skills, Good Communication &amp; Interpersonal Skills Preferred Qualifications Broadcasting, automotive or Industry equivalent experience Working knowledge of broadcast data protocols (TPEG, TMC, HD Radio, Maps, Geolocation) Education B.S. in Computer Science/Engineering or equivalent Location Austin, TX: 3601 S Congress Avenue, Bldg F, 78704 Position Type Regular The Company is an equal opportunity employer and will not tolerate discrimination in employment on the basis of race, color, age, sex, sexual orientation, gender identity or expression, religion, disability, ethnicity, national origin, marital status, protected veteran status, genetic information, or any other legally protected classification or status. Our organization participates in E-Verify. Click here to learn about E-Verify. Current employees and contingent workers click here to apply and search by the Job Posting Title."},
{"title": "Web Developer Software Engineer", "company": "Solcius", "location": "Provo, UT", "description": "Job Description Solcius is looking for an experienced developer with a passion for understanding our users' needs and building awesome web-based tools! The ideal candidate will have experience working with back-end automation using Java/Apex, Node.js, and SQL as well as building front-end applications using JavaScript frameworks like Vue.js. They will be an effective troubleshooter with the ability to work with project managers and other developers to build and maintain products using proper source control methods. Finally, they will enjoy exploring new technologies and thrilling users with fast and effective feature releases. Essential Skills 4+ years experience building application logic with one or more of the following languages: Apex, Java, JavaScript/Node, C(#, ++), Ruby, Python 2+ years experience web development, particularly single page applications (SPA) Experience using JavaScript frameworks such as Vue.js, React,js, or Angular for building single page applications (SPA) Ability to collaborate with Project Management to understand and develop to specific product user stories Strong debugging/troubleshooting skills Ability to work independently on assigned projects and proactively address roadblocks Effectively communicate technical information and project statuses Preferred Experience Salesforce development (Apex Classes/Triggers, Visualforce) Backend API development with Node.js/AWS Lambda Implementing and consuming RESTful APIs Database interaction including read and write operations (SQL, SOQL, MongoDB, DynamoDB) Source control with Git/BitBucket AWS hosted services such as EC2, S3, or RDS Implementing functional testing (Apex Test Class, Selenium, Jest) Salary DOE Please review our website."},
{"title": "Software Development Engineer I", "company": "Apptio", "location": "Remote, OR", "description": "You You are a software engineer who is passionate about acquiring new technologies and strive for excellence in serving customers with high-quality technical solutions. You enjoy the work you are doing; continuously innovate, advance ideas to build better software. You thrive in an agile, fast-paced, and highly collaborative team environment. Us We are a high-performing cross-functional team of developers, product managers, and designers. Our team delivers cost optimization recommendations by ingesting hourly usage data. We create models based on cloud vendor financial constructs applying those to show our customers how to save money. We work on large data sets creating meaningful intuitive solutions to complex problems. What We Want You To Do You will collaborate with your team to deliver impactful and valuable features. You will work on end-to-end features from concept to design to production, and partner with product managers, user experience designers, and other engineers to achieve high-quality solutions. Basic Qualifications Ability to handle multiple competing priorities in a fast-paced environment Strong knowledge of data structures, algorithms, enterprise systems, asynchronous architectures, and object-oriented programming Demonstrated experience with best SDLC practices: coding standards, reviews, code management, build processes, and testing Experience with relational databases, schema design, SQL B.S. in Computer Science or equivalent experience Preferred Qualifications Experience with backend web-based GO/Java development and Linux-based integrated development environments. Experience with cloud technologies in AWS, Azure, or Google Cloud, etc. Experience developing Software as a Service (SaaS) applications and understanding the impact of this architecture in a deployment environment Database implementations (query optimization, index generation, caching) or NoSQL DBs a plus Apptio benefits include Company-Paid employee health, dental, vision, life, and disability insurance, and generous contributions to a health savings account. We also offer participation in a flexible spending account, 401k, and other voluntary programs. The Company Apptio is the leading software to fuel digital transformation. We help technology and finance leaders make smart decisions as they plan, analyze, and optimize technology investments in pursuit of digital transformation. Apptio’s software uses machine learning to translate technology costs and utilization across on-premises systems, vendors, projects, agile and cloud systems into a holistic, business-centric view. With Apptio, IT leaders make smarter digital transformation investments. Companies of all sizes and geographies trust Apptio to fuel their digital transformation, including 50% of the Fortune 100. For more information, please visit www.Apptio.com. Apptio Inc. is not open to 3rd party solicitation or resumes for our posted FTE positions. Resumes received from 3rd party agencies that are unsolicited will be considered complimentary. Apptio, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Apptio, Inc. complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This is a remote position."},
{"title": "Jr. Software Engineer", "company": "LightDeck Diagnostics", "location": "Boulder, CO", "description": "LightDeck Diagnostics of Boulder, CO (www.lightdeckdx.com) seeks a junior-level software engineer to develop medical device software for LightDeck products. LightDeck Diagnostics believes in a new approach to healthcare where fast, accurate, simple, low-cost diagnostic tests will be run wherever and whenever they are needed, without compromise. Our proprietary LightDeck® platform combines an advanced laser waveguide with novel materials and patented manufacturing techniques to deliver lab-quality results anywhere, in minutes. We are introducing a portfolio of in vitro diagnostic panels; the first is an on-the-spot test for COVID-19. The LightDeck platform is currently commercialized in veterinary diagnostics and for environmental testing. The candidate will join a small, fast-moving, multidisciplinary group focused on instrument and assay deliverables. Working in a small company as part of the software development team, the Software Engineer will be expected to be self-motivated, creative, adapt quickly, wear many hats, and do whatever it takes to meet deadlines. This position offers enormous growth potential to persons with high initiative, leadership potential, and proven records of technical accomplishment. Requirements The Software Engineer will be responsible for Developing embedded software to be run on the MBio instrument in accordance with FDA and ISO software validation methods. Writing, documenting, and reviewing C/C++ code to achieve published requirements/specifications. The Software Engineer will be part of the LightDeck engineering team and will work closely with other LightDeck product development and manufacturing teams. Requirements At least 2 years of professional software development experience Demonstrated knowledge of object-oriented C++ programming Desired Skills No single candidate is expected to have demonstrated skill in all functions listed below, but strong preference will be given to candidates with the following skills and experience Medical device experience (or similarly regulated field) Understanding of software development/validation under IEC 62304 within an FDA QSR or ISO 13485 quality management system. Experience working within a Linux development environment Embedded platform development (particularly Yocto/Poky) Gui development (particularly Qt) Developing automated tests with an xUnit/mock framework Network connectivity programming Interconnectivity to a laboratory information management system (LIMS) using HL7 protocol Software hardening techniques against cybersecurity attacks Applicant must have authorization to work in the U.S. Resumes must be accompanied by a cover letter explaining how the applicant meets the job requirements and desired skills. Please email cover letter and resumes to jobs@lightdeckdx.com with applicant name and the job title listing in the subject line. No phone calls, please. LightDeck Diagnostics is an Equal Opportunity Employer committed to a diverse workforce. Benefits Our organization of ~70 people works on proprietary technology that has the potential to have a huge impact on the world (see recent press release on our website).Company benefits include medical, dental, vision, disability, simple IRA with company match, PTO, paid holidays, as well as a casual and collaborative work environment, office snacks and drinks. Located near Boulder's many bike trails, our employees often bike or walk to work. We are committed to work life balance, and seek to support our employees with professional development opportunities that expand their skills and abilities. Come join the LightDeck team today and make a difference!"},
{"title": "Software Engineer", "company": "Tesla", "location": "Fremont, CA", "description": "THE ROLE As a Software Engineer you’ll take part in the design and development of software for the current and next generation of Tesla’s Enterprise Resource Planning systems. In this role, you’ll be developing highly complex applications with a team goal of streamlining business operations and improving overall user experience. The ideal candidate is a self-starter with a strong desire to increase efficiencies, and make an impact while contributing to a cross-functional team. Your ability to creatively collaborate and execute team goals will affect scalabiliy and directly contribute to the company mission of accelerating the world’s transistion to sustainable energy. Responsibilities Work with experienced engineers across many functional areas to deliver business value to internal and external stakeholders. Design and develop new modules on the home grown ERP application Warp which is used to plan, procure and produce cars. Develop scalable solutions using tools like Angular, C# dotNet, MySQL and other open stack frameworks. Know your app! Seek to understand all aspects, business and technical, of the applications on which you work so that you can be most effective. Contribute towards the timely completion of development tasks and small projects while applying company standards. Continually learn and apply relevant software development practices, patterns, tools and technologies. Increase efficiency, reduce waste wherever and whenever possible. Requirements 4+ years in web application development, including: Implementing Application Programming Interfaces (APIs), Object Oriented Programming and Design (OOP&amp;D), Object Relational Mapping (ORM) Experience in frontend development, using tools such as: JavaScript, Angular, React, etc. Experience in backend development, using tools such as: C#, Java, Go, Ruby, etc. Relational databases, SQL, NoSQL Agile Development Distributed Source Control, using tools such as: Git Education: BS/MS in Computer Science or equivalent degree."},
{"title": "2021 University Graduate - Software Engineer", "company": "Adobe", "location": "Seattle, WA", "description": "Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! The Challenge Adobe is looking for a Computer Science or Engineering graduate to join our Cloud Collaboration Platform team to help build our next generation of Sharing Services. Someone who is hungry to apply there newly acquired skills to help us develop and test our Cloud Collaboration Platform Gets excited about solving complex problems Is open and interested in learning new technologies, skills, and programming languages as needed Comfortable with test-driven development What You'll Do Working in a collaborative team environment to help build, document, test, deploy, monitor, and/or maintain a suite of REST APIs. This will include: Participating in a growing Scrum team with continuous integration in a collaborative team environment. Providing Documentation as needed for specifications and/or test planning. Building and/or testing REST APIs. Optimizing and/or testing for scalable performance and robustness. Deploying and updating Services using Kubernetes. Supporting other product teams and/or clients within Adobe. Monitoring and troubleshooting multiple Services using Enterprise diagnostic tools. What we expect from you Ability to learn quickly Work effectively within a team environment. Write well-engineered and tested code. Knowledge of Cloud Computing. Knowledge of the fundamentals of HTTP protocols and familiar with caching and/or message queuing Technologies We Use Languages such as GoLang, JavaScript Tools such as Splunk, Prometheus, AWS, Azure"},
{"title": "Software Engineer", "company": "Salesforce", "location": "Buenos Aires, Buenos Aires Province, Argentina", "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details MuleSoft, a Salesforce Company sits at the heart of all convergent technologies trends (SaaS, big data, APIs, microservices, etc.), and our developers are tackling some of the most challenging problems in technology today. As a Software Engineer at MuleSoft, a Salesforce Company, you will work on a small SCRUM team to drive the development of modular, composable, and/or maintainable microservices to expose the functionality of the Anypoint Platform to customers and allow us to scale platform usage around the world. Our teams own mission-critical aspects of a rapidly growing, globally distributed platform and, as such, you will have an incredible amount of impact on the current state and future direction of our product, with visibility throughout the organization and a significant opportunity to take ownership. MuleSoft Software Engineers come from a wide variety of backgrounds and work anywhere in the stack, but all care about craftsmanship in their code, are naturally curious self-learners, and build the right solution for the long term rather than the right solution for right now. 3 Months What you’ll achieve: Become comfortable with MuleSoft tools and processes by partnering with a member of your team to ramp up effectively. Consult with internal stakeholders in product and DevOps on best practices and standards within MuleSoft. Start cutting code! 12 Months Work with the team to deliver more significant, longer-term, or larger-scale challenging projects. Participate in at least one major platform release. Take operational ownership of services you have delivered to production. What You’ll Need To Be Successful Great engineering skills, strong CS fundamentals, and elegance in your work Expertise in at least one language and open to learn others. Our engineers have all types of backgrounds, including Java. A strong sense of ownership of the work you do and belief in doing things the right way for the right reasons Proven track record of solving problems creatively A fanatical pursuit of quality with a strong appreciation for the connection between the software you build and the experience it delivers to customers Natural curiosity, ability, and desire to learn quickly Perks Competitive compensation Stock options Annual performance bonus program OSDE 410 for your family group Wellness reimbursement Unlimited vacations Competitive Education Reimbursement Program Extended parental leave And so much more! Accommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org. Salesforce welcomes all."},
{"title": "Software Engineer I", "company": "Careem", "location": "Karachi Division, Pakistan", "description": "Careem is the leading technology platform for the greater Middle East. A pioneer of the region’s ride- hailing economy, Careem is expanding services across its platform to include payments, delivery and mass transportation. Careem’s mission is to simplify and improve the lives of people and build a lasting institution that inspires. Established in July 2012, Careem operates in more than 130 cities across 15 countries and has created more than one million job opportunities in the region and host over 30 million users. Key Responsibilities Include Write high quality, performant and reliable code while working on defined tasks/bugs independently. Design highly scalable and well-bounded web services that deliver on business requirements. Participate in the on-call rotation and be willing to jump in and help resolve any incidents within the defined SLA. Participate in team agile processes and practices, contribute to their continuous evolution. Work closely with other engineering leaders across the team to design and build highly scalable and robust services. Deep dive into all parts of Careem technology stack (Java, JS frameworks, Mobile frameworks) Participate in pair programming, TDD and follow clean code practices Basic Qualifications Bachelor's Degree in Computer Science or other related technical field. 2+ years of professional experience in Software Development and a solid grasp of JS frameworks, HTML/CSS(BootStrap), and microservice ecosystems. Proficiency with Computer Science fundamentals including data structures, algorithms, complexity analysis. Experience working in an Agile/Scrum environment to deliver high-quality software against aggressive schedules. Experience building progressive web applications in Angular and/or React. Preferred Qualifications Willingness building scalable distributed systems on AWS, using the Java / Spring framework. Willingness in rapid prototyping and other fast iteration methods for product development. Willingness to roll up your sleeves and do what's necessary to drive your projects to completion. Knowledge of professional software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations. Strong focus on customers and operational excellence."},
{"title": "Software Engineer", "company": "Mindtree", "location": "Bengaluru, Karnataka, India", "description": "The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.    Responsibilities Develop quality software and web applications Analyze and maintain existing software applications Design highly scalable, testable code Discover and fix programming bugs Qualifications Bachelor's degree or equivalent experience in Computer Science or related field Development experience with programming languages SQL database or relational database skills"},
{"title": "Software Engineer", "company": "Splunk", "location": "Vancouver, British Columbia, Canada", "description": "Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey! Role Do you embrace challenges, and possess an abiding real passion for excellence? Then Splunk is where you desire to embark on the next phase of your career journey. We are rapidly growing our pool of extraordinary talent with an inspired group of enthusiastic, ambitious, and superiorly gifted front-end and back-end Software Developers, UX Designers, and Product Engineers. You will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. Working to support internal and external customer needs, you will collaborate with cross-functional teams, receive mentorship, and gain insight into our values-driven process. Our goal is both to support your growth and development while empowering you for a successful start to your career. Responsibilities Splunk is looking for highly motivated new college grads to join our team. You will work on real projects that go to market. You will also have an opportunity to enjoy our dynamic, startup-like environment. You will get invaluable work experience at a leader in “Big Data”, the hottest software market now, and you will have the opportunity to focus on full-stack, backend or front-end technologies. Requirements Familiarity with Unix/Linux and/or Windows OS, Linux is preferred Strong knowledge of programming in Python, C++, JavaScript Experience with version control systems, Perforce, Git or similar Enthusiasm for solving interesting problems You enjoy working well with others in a fast-paced environment You enjoy working within an agile environment Strong communication skills, verbal and written Education Completed a Bachelor’s degree in Computer Science or related major, and strong record of academic achievement Minimum 6 months relevant work experience What We Offer You The opportunity to work with a set of extraordinarily talented and dedicated peers, all the way from engineering and QA to product management and customer support. Splunk flourishes with disruption and diversity. A constant stream of new things for you to learn and an opportunity for growth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation. A stable, collaborative and supportive work environment. We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records."},
{"title": "Software Engineer (backend focused)", "company": "dscout", "location": "Chicago, IL", "description": "About Dscout We are dscout. At our core, we are People Nerds. We empower our customers to meet the people who matter to them in the moments that matter most. Customer-obsessed companies and agencies like Salesforce, Sonos, Groupon, and Best Buy use dscout to build better products and services because of people like you. We are building a smart and driven team, and we would love for you to join us. our platform Our platform is built on cutting edge technology with React.js frontend and Elixir backend tied together by GraphQL APIs with a small part done in Ruby/Rails and REST APIs. We make heavy use of PostgreSQL and Redis for our storage needs and we host our platform on Heroku. Another core part of our offering are two mobile apps - iOS and Android - that are written in Swift and Java respectively. We also employ WebRTC, Twilio, and Websockets for live video streaming and use Python for NLP and video / audio processing. Eight years and 45K commits later, we've maintained a tidy code base that is well documented and battle tested by tens of thousands of users. you are We’re looking for smart, creative, and driven Software Engineers to build great software with us. You have some experience as an engineer (creating and launching new products) and you are eager to keep learning and growing. You love to write code, and strive to make it better with each commit. You're familiar with SaaS-focused modern backends, API development, SQL, and don't mind doing an occasional frontend task either. You are hands-on, self-directed, and feel at home in a fast-paced, collaborative, and agile environment. If you are excited about the challenge of building an incredible product while working alongside a great engineering team, we’d love to hear from you! the job what you will do Be an active member of a cross-functional product development team that frequently interfaces with business stakeholders Collaborate with teammates to continuously improve the ways you and your team work Focus on backend work, with some frontend involvement Develop customer facing applications in a fast-paced agile environment Be responsible for the technical quality of the team's product Work closely with the design team to deliver user-friendly and modern products Apply DevOps mindset to improve the Continuous Delivery pipeline and other operational aspects of our SaaS platform what you need to have 1+ years experience as a software engineer Experience with Ruby, Python, or a similar backend language Interest in learning and using Elixir; open to working in a polyglot environment Good working knowledge of SQL Experience with full stack architectures, as well as API design and implementation Familiarity with frontend development Familiarity with Agile, DevOps, and CI/CD Exposure to cloud architectures - Heroku, AWS, or others Note: As a result of COVID-19, the dscout team has decided to work remotely for the time being. However, we are now interviewing, hiring, and onboarding remotely for all open roles! While our office is temporarily open for teammates who feel comfortable coming in, no current or future employees will be required to come back into our office until (at least) July of 2021. What We Provide Here at dscout, we are a team of passionate research, sales, technical, marketing, design, success, and operations professionals. We are driven by the power of research—how in-context insights from real people can build products and services that are more people-centric. We value learning, sharing, and building. We deeply value being a diverse and inclusive team and company, and we are looking for team members who align with that belief. We are proud of what dscout is today and we are excited to build our future with you. In addition to joining a smart and passionate team, you will get: A strong compensation package with bonus structure. Your success is tied to company success. We are all in this together. An incredible set of core benefits as well as a 401k with match, solid PTO policy, and generous company holidays. We are committed to supporting our team. Exposure to the inner workings of a growing company, including open, transparent communication within our team. You will know what is happening and why it matters. An education stipend. We are committed to helping build your future. A beautiful workspace along the Chicago Riverwalk, that is temporarily open for teammates who feel comfortable coming in and working from there. Read more about our new office space here! dscout is an equal opportunity employer that values diversity. We do not discriminate based on identity- race, color, religion, national origin or ancestry, sex, gender identity and expression, age, physical or mental disability, pregnancy, veteran or military status, unfavorable discharge from military service, genetic information, sexual orientation, marital status, order of protection status, citizenship status, arrest record or expunged or sealed convictions, or any other legally recognized protected basis under federal, state, or local law. Powered by JazzHR NpplSd7qKH"},
{"title": "Software Engineer", "company": "KPMG Sweden", "location": "Stockholm, Stockholm County, Sweden", "description": "Do you want to be part of KPMG´s newly established function?   KPMG is one of the most trusted and respected professional services firms in the world.   Our new function, Lighthouse, leverages the latest KPMG data, analytics, intelligent automation and artificial intelligence technologies to help build and deliver solutions for clients’ unique business needs.   Lighthouse is now recruiting front-end and full-stack software engineers. About us Lighthouse is a group of ambitious and passionate individuals with various backgrounds, experience and technical skills ranging from software engineers, to data scientists, to cloud architects. All our services are based on our already existing domain expertise, giving you the possibility to learn and apply your own knowledge to create maximal value. You will be given a high degree of freedom and will be part of our delivery teams towards building scalable and robust services. Are you ready to fully leverage your technical skills? The journey has started, and we want more passionate individuals to be part of KPMG Sweden’s digital journey. The role As a Software Engineer you will work at the core of everything we build here at KPMG Sweden Lighthouse. We support our clients as well as internal business units such as Audit, Tax and Advisory in developing complex, data-driven and scalable software systems. We work with clients across different sectors such as healthcare, defense, transportation, infrastructure, communications, energy/natural resources, financial services, leisure, retail and manufacturing. As a Software Engineer, you will design, build and maintain efficient, reusable and reliable code. From architecture to testing, you will be solving complex problems as part of a team as well as individually. You will be working in an Agile way. Our values At KPMG our values define who we are and the way we do business. As a leading professional services firm, we know that our strength and capability come from our people and their different perspectives, experiences and backgrounds. From our inclusive leadership strategy to our diversity and inclusion targets, we’re making bold changes to who we are and what we do, and you will be a part of it. Technical Skills Undergraduate degree in computer science, engineering, mathematics or equivalent At least 2 years of work experience and practical exposure to React Practical exposure to at least one public cloud provider: Azure, AWS, GCP, etc. Practical exposure to some form of database Practical exposure to working in an Agile environment is a plus Non-Technical Skills You enjoy solving complex problems and getting any job well done You are a team player and collaborate flawlessly You communicate exceptionally well both verbally and in written form in English You work well under pressure, manage your time and learn new concepts quickly You are committed to documenting your code and testing it thoroughly You can teach your skills to others when needed You are VERY attentive to detail Want to make a difference with us? Then you are warmly welcomed with your application! We are happy to receive your application as soon as possible, however no later than 2020-12-31. If you have any questions or concerns about the service, you are welcome to contact responsible recruiting Manager Radu Petrescu: radu.petrescu@kpmg.se or Talent Manager Caroline Dajen: caroline.dajen@kpmg.se. Once your application is received, you will go through the following stages: Phase 1 – Inception:  Reviewers will check your CV and screening questions. Phase 2 – First Interview:  When you pass phase 1, you will have a video interview in which you will have to solve a theoretical problem. This typically lasts under 1 hour. Phase 3 – Case Presentation:  When you pass phase 2 – you will be presented with a real-world case – you will need to build and present your solution to our team. If you pass this, congratulations and welcome to KPMG! You will receive an employment proposal! * Please note that we are not sponsoring work visas."},
{"title": "Software Engineer - Full Stack", "company": "LinkedIn", "location": "Bengaluru, Karnataka, India", "description": "Software Engineer Bangalore - India LinkedIn was built to help professionals achieve more in their careers, and everyday millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to have a direct impact on the world’s workforce in ways no other company can. We are much more than a digital resume – we transform lives through innovative products and technology. Creating economic opportunities for every member of the global workforce is a responsibility we all share. To truly transform the global economy, we must evolve in the way we hire and enable our talent to serve people of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. As a part of Trust Engineering, the Account Access team provides highly secure, intuitive and frictionless authentication for members. The team is fast paced, focused on enhancing account access user experience for millions of members with high security. We directly impact the Weekly Active Users on the platform. As a full stack software developer, you will be responsible for developing world class features that empower LinkedIn to enable more members to sign in. Responsibilities: You will own the front-end development of our products and collaborate with User Experience Designers and Product Managers and build world-class user experience. You will implement cutting-edge technologies and will be writing state-of-the-art code to keep LinkedIn at the cutting edge of current technology. You will design and scale high scale services that integrate with the larger LinkedIn Platform to drive engagement on the platform. You will provide technical leadership in driving and performing the best engineering practices to initiate, plan, and execute large-scale, cross functional, and company-wide critical programs. Identify, leverage, and successfully evangelize opportunities to improve engineering productivity. Basic Qualifications: - BS in Computer Science or related technical field involving coding - 1+ years of hands on web development experience with object-oriented JavaScript, jQuery, semantic HTML, CSS. - Experience with developing backend services in Java. Preferred Qualifications: - 2+ years of relevant work experience. - MS or PhD in Computer Science or related technical discipline. - Experience writing clean JavaScript including experience with modern frameworks (Angular/Ember/React) and debugging tools (Chrome Dev Tools, etc). - Expert-level knowledge of Ember. - Knowledge of (and a passion for) current trends and best practices in front-end architecture, including performance, accessibility, security and usability. - Experienced in Unit / Integration / Visual Testing. - Experience with JSP and Dust programming is a plus. - Ability and eagerness to program progressive, single-page applications (Backbone / Angular/ Play framework). You will Benefit from our Culture: We strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels. India Disability Policy LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. For more information on our equal opportunity policy, please visit http://careers.jobvite.com/linkedin/India-LinkedIn-Equal-Opportunity-for-Persons-With-Disabilities-Policy-2018.pdf Global Data Privacy Notice for Job Candidates This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice"},
{"title": "Software Engineer I", "company": "Expedia Group", "location": "Montreal, Quebec, Canada", "description": "Si vous êtes un développeur de logiciels à la recherche de nouveaux défis et désirant avoir un impact significatif au sein d’un des plus grands sites de commerce électronique dans le domaine du voyage, vous êtes au bon endroit! L’équipe Plateforme de contenu est la recherche de développeurs passionnés par la création de solutions logicielles dans un environnement agile. À propos de l’équipe Plateforme de contenu Dans Notre Équipe Vous Trouverez Des Défis Tels Que L’équipe de Plateforme de contenu est établie à Montréal depuis environ 10 ans et a pour mission de fournir le meilleur contenu à toutes les marques de commerce d’Expedia. Distribution de contenu à haut débit sur plusieurs sites transactionnels à travers la planète. Localisation de contenu dans plus de 40 langues pour toutes les équipes d’Expedia. Génération de texte basé sur des données factuelles pour plusieurs secteurs d’activité liés au voyage. Plusieurs projets d’apprentissage par machine afin d’optimiser l’acquisition de contenu, la déduplication et l’extraction de métadonnées. Dans ce rôle, vous pouvez vous attendre à... Concevoir, développer, déboguer, supporter et modifier des applications et des outils logiciels dans un environnement agile. Travailler sur des projets ayant un impact direct sur les clients et soutenir les initiatives stratégiques des marques ou des unités d'affaires. Rejoindre un environnement énergétique où la proactivité et la contribution de chaque membre de l'équipe est important. Développer dans un environnement où les livrables incluent un produit de haute qualité via des tests unitaires, des analyses de code, des tests d'intégration. Faites partie d'une équipe avec une forte volonté de fournir des résultats qui apportent de la valeur à l'entreprise. Développer en utilisant les meilleures pratiques d’intégration continue (DevOps) ainsi que certaines des meilleures technologies infonuagiques. Ce que nous recherchons Un minimum de 2 ans d'expérience en tant que développeur de logiciel dans l'écosystème Java. Une bonne connaissance de Java 11, Spring, Springboot. La connaissance de Kotlin, AWS, Kubernetes, GraphQL, de l’expérience dans le développement d’interfaces utilisateur et de travail dans un environnement Agile/Kanban sont un atout. Intérêt pour l'intégration continue / infrastructure de livraison continue. Une volonté et une capacité d'apprendre de nouvelles technologies. Un excellent esprit d'équipe. Une capacité à communiquer avec les parties prenantes ayant différents rôles et appartenant à différentes unités d'affaires. Bon niveau de communication, anglais courant (français un atout); Diplôme de baccalauréat ou supérieur. Les normes culturelles sont l’essence d’Expedia Nous croyons en la différence . Nous recherchons de nouvelles idées, de nouvelles façons de penser, différents contextes et différentes approches, car la normalité peut mentir et la similitude est dangereuse. Ainsi, nos normes ne sont ni des règles, ni des principes universels applicables à tous les niveaux de notre entreprise. Toutefois, elles sont fondamentales à notre identité et à la collaboration entre tous nos employés. Et à l’instar de notre entreprise, ces normes évoluent. Nous sommes transparents . Nous communiquons de manière ouverte et franche à tous les niveaux, avec nos supérieurs, nos collègues et nos collaborateurs. Nous faisons apparaître rapidement les problèmes difficiles, nous agissons, nous apprenons. Nous faisons preuve de diligence . Nous cherchons à recueillir les informations le plus rapidement possible et nous réagissons. La réactivité nous permet de faire des erreurs, et de nous améliorer sans cesse. Nous croyons en la méthode scientifique . Face aux données objectives, les idées de chacun sont sur un pied d’égalité. Nous les utilisons pour nous guider, et non pour définir nos actions. Nous dirigeons avec humilité . Chez nous, les responsables sont au service de leurs équipes. Personne parmi nous ne détient toutes les réponses, mais nous sommes de nature curieuse et nous cherchons toujours à apprendre. Bien que nos responsables assument avec la plus grande rigueur leurs responsabilités envers notre entreprise et leurs équipes, ils ne se prennent toutefois jamais au sérieux. Nous agissons en tant qu’équipe . Nous visons l’optimisation pour le bien de tous et non seulement dans notre propre intérêt, ni celui de nos équipes. La réussite des autres nous intéresse vivement. Les projets sur lesquels vous travaillez chez Expedia permettent d’améliorer l’expérience de millions de voyageurs du monde entier, en plus de connecter les gens et de les outiller en matière de voyages. Expedia s’engage à créer un milieu de travail accueillant comptant un effectif diversifié. Toutes les candidatures admissibles seront examinées sans égard à la race, à la religion, au genre, à l’orientation sexuelle, à l’origine ethnique, aux handicaps ou à l’âge. À propos d’Expedia, Inc. Notre mandat est de révolutionner le monde du voyage grâce à la puissance de la technologie. Collectivement, les marques d’Expedia, Inc. couvrent tous les aspects du voyage, que ce soit pour la recherche, la planification, les réservations, la sélection du meilleur siège d’avion, la lecture d’évaluations d’hôtels par les clients ou la planification des activités durant le séjour. Les marques Expedia, Inc. s’adressent tant aux vacanciers qu’aux voyageurs d’affaires et répondent à tous les goûts et à tous les budgets, des plus modestes aux plus luxueux. Expedia répond à la demande des consommateurs en matière de voyage sur pratiquement tous les continents en les dirigeants vers nos fournisseurs de services, qui représentent près de 149 000 hôtels ainsi que des centaines de compagnies aériennes, de voyagistes, d’entreprises de location de voitures et de services à destination. Visitez le site http://www.expediainc.com/expedia-brands/ pour en apprendre davantage au sujet de nos marques. In English Software Developer If you are a Software Developer seeking new exciting challenges where you can make an impact working for one of the largest Online Travel Ecommerce web sites in the world, look no further. The Content Platform team is seeking Developers with a passion for the delivery of software solutions in an agile development environment. About The Content Platform Team The Content Platform team has been established in Montreal for approximately 10 years and is dedicated to providing the best content to all Expedia trademarks. In our team you will find challenges such as: High-volume content distribution across multiple transactional sites around the globe. Localization of content in more than 40 languages for all Expedia teams. Fact-based text generation for several lines of business. Multiple machine learning projects to optimize content acquisition, deduplication and metadata extraction. What You'll Do Design, develop, debug, support and modify software applications and tools in an agile environment. Working on projects that have a direct impact on customers and support strategic initiatives of brands or business units. Joining an energetic environment where each team member's proactivity and contribution is important. Developing in an environment where the definition of done includes high quality deliverables via unit testing, code review, integration testing. Be part of a team with a strong will to deliver results that brings value to the business. Develop using best practices of continuous integration (DevOps) as well as some of the best cloud technologies. Who You Are A minimum of 2 years of experience as a software developer in the Java ecosystem. A good knowledge of Java 11 or more, Spring, Spring Boot. Kotlin, AWS, Kubernetes, GraphQL, UI development and work in an Agile/Kanban environment will be an asset. Interest in continuous integration/continuous delivery infrastructure. A strong will and ability to learn new technologies. An excellent team spirit. An ability to communicate with stakeholders having various roles and belonging to different business units. Fluent English (French is also an asset). Bachelor's degree or higher. Why Join Us Expedia Group recognizes our success is dependent on the success of our people. We are the world's travel platform, made up of the most knowledgeable, passionate, and creative people in our business. Our brands recognize the power of travel to break down barriers and make people's lives better –   that responsibility inspires us to be the place where exceptional people want to do their best work, and to provide them to tools to do so.   Whether you're applying to work in engineering or customer support, marketing or lodging supply, at Expedia Group we act as one team, working towards a common goal; to bring the world within reach. We relentlessly strive for better, but not at the cost of the customer. We act with humility and optimism, respecting ideas big and small. We value diversity and voices of all volumes. We are a global organization but keep our feet on the ground so we can act fast and stay simple. Our teams also have the chance to give back on a local level and make a difference through our corporate social responsibility program, Expedia Cares. If you have a hunger to make a difference with one of the most loved consumer brands in the world and to work in the dynamic travel industry, this is the job for you. Our family of travel brands includes: Brand Expedia®, Hotels.com®, Expedia® Partner Solutions, Egencia®, trivago®, Vrbo®, Orbitz®, Travelocity®, Wotif®, ebookers®, CheapTickets®, Hotwire®, Expedia® Media Solutions, CarRentals.com™, Expedia Local Expert®, Expedia® Cruise® and SilverRail Technologies, Inc. For more information, visit www.expediagroup.com . Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."},
{"title": "Software Engineer - University Graduate", "company": "PayPal", "location": "San Jose, CA", "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 286 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Job Description Summary: At PayPal, we’re literally reinventing how the world pays and gets paid. We understand that it’s about people. We connect individuals to let them shop, get paid, donate and send money using today’s technology with the confidence that comes from the security and control PayPal enables. Are you ready to help us change the world? The world’s leading payments company, PayPal, brings together a family of brands that are revolutionizing the way people move money. At PayPal you will be immersed in an amazing community with a vibrant culture that thrives on innovation, collaboration, inclusion and wellness. Job Description: Software Engineers at PayPal develop innovative solutions and high-quality products that touch millions of people every day around the globe. Our engineers solve some of the most complex technical problems in the world of connected payments across all business units, including PayPal, Braintree, Venmo, Paydiant and others. We are looking for the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward with respect to functionality, performance, reliability, and scalability. You’ll work alongside the best and the brightest engineering talent in the industry. We have opportunities in a wide range of areas including development, design, search, platform, test, quality, big data, front end and back end. As a core participant of your team, you’ll estimate engineering efforts, design your changes, implement and test your changes, push to live, and triage production issues. You need to be dynamic, collaborative, and curious as we build new experiences, improve existing products, and develop distributed systems powering the world’s largest e-commerce and payments websites at a scale only a few companies can match. Key Responsibilities : Code high-volume and scalable software Create web applications using React/Node and other technologies Create back end services using Java, SQL, ReST Build and develop new user facing experiences Partner closely with cross functional teams in design, product and other business units Basic Requirements: Graduated within the past 12 months, or will be graduating by Spring 2021, with a Bachelor’s or Master’s degree in Computer Science or related field from an accredited college or university Strong applied experience. You’ve built, broken, and rebuilt software applications. We’re looking for creative thinkers who also know how to create real-world products. Working knowledge of web technologies (such as HTTP, HTML/DOM, JavaScript, CSS, AJAX) will be beneficial Familiarity with Node.js applications Familiarity with Java, C++ and/or Python Understanding around concepts like Web Services, SOA, REST APIs A constant desire to grow, learn, and explore new things Position Location: Varies We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom. PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. REQ ID R0057736"},
{"title": "Software Engineer Specialist", "company": "Loggi", "location": "São Paulo, São Paulo, Brazil", "description": "_ Our business Through technology (mobile, AI, automation, IOT), we have created a next-generation logistics network and we are, in an unprecedented way, positioning ourselves to unleash the growth of a new trade in Brazil with a fast, cost-effective and reliable logistics solution. By the end of 2021, we want to be present in all Brazilian cities and reach the milestone of 5 million deliveries per day by 2025. With SoftBank, Microsoft, GGV Capital and others, the new investment round has brought Loggi’s valuation up to US$1 billion hitting the unicorn mark! “Our mission is to deliver everything to everyone everywhere as quickly as possible. We want to connect Brazil and value, for example, Amazonian handicrafts, enabling artisans to sell without intermediaries to consumers in any region.” ( Fabien Mendez, CEO - Chief Executive Officer ) _ Our Engineering team Loggi’s engineering team is focused on solving highly complex problems, mixing up very experienced professionals and early career employees, in a fortified environment by learning, sharing of experiences and respect. Together, we will build the logistics network of the country, developing unique algorithms, systems and processes. Our leaders have already left their mark in the national and worldwide tech scenario, working in companies like Google and UOL. They are engaged in finding how to develop a group of more than a thousand programmers to explore the knowledge borders and connect the country. We believe and invest in everyone's potential \"Over the next 5 years we want to train Brazil’s future CTOs! Here, we have a structured development program.\" ( Davi Reis, CTO - Chief Technology Officer ) Requirements _ Responsibilities You will architect and develop high quality scalable solutions, being part of multidisciplinare squads seeking an amazing and efficient experience for the users! As the technical focus point on a squad, we’ll count on you on the development of ideas and solutions that solve complex problems and generate great results for the team. Loggi’s engineering team works with a wide variety of technologies and techniques to solve our challenges. We try to see beyond the buzzwords to develop software in a pragmatic and efficient way. To spark your curiosity, we work on python/django, kotlin/micronaut; predictive models trained with sklearn and keras/tensorflow; native and hybrid apps, and PWAs; algorithms of optimization based on or-tools, Systems in Azure and AWS, with and without kubernetes. In addition we also use Looker and ELK for dashboards and analysis. _ Requirements 10+ years of relevant work experience in software development or 7+ years in academic / technical field, regardless of language/technology; +1 year leading technical teams and projects; Good knowledge of algorithms and data structure; Experience working in a collaborative way with squads and tribes (engineers, product managers and designers); Autonomy, analytical mindset, problem solving abilities supported by best practices in coding; Willingness to work full-stack and easy transition between technologies and languages, being a technical reference in a product or technology; Familiarity with agile trends. Benefits _ Our benefits For a healthier life, we provide you Health plan with national coverage (without discounts!) Dental plan (also without discounts!) Flexible hours with the possibility of working at home according to function and demand Discounts of up to 75% in gyms all over Brazil Fresh fruit every day at the office We support you with Above average remuneration of the best technology companies in Brazil, with annual reviews Eligibility for Stock Options Meal voucher and transportation voucher with symbolic discount of R$ 1 Possibility of payroll loan after 3 months of company We develop you with US$ 3,300 for technical development per year Immersion week in all areas of the company, our famous Xboarding Frequent knowledge exchanges with internal and external professionals Individual development plan updated every six months Feedback culture and opportunity to work according to the squad concept Working with big names in the history of technology in Brazil Possibility to develop new algorithms with the challenge of creating the new generation of logistics We help parents with Health and dental plan for children at no extra cost 6-month maternity leave and 20-day paternity leave Daycare allowance of R$ 457 per child up to 5 years of age Some of our offices also have Massage, manicure, pedicure at reduced costs Pet day Game rooms with video games, pool and others Locker room and spaces to store your bike or scooter safely Marketplace selling quick meals, drinks and snacks _ Our culture Inclusive, determined and visionary that's who we are and how we work here. We are already more than 1000 Loggers. We are hi-tech, little conservative and we are always up to date! Above all, we hope that everyone is eager to learn and acquire new knowledge quickly. We look for an increasingly inspiring and welcoming work environment, and we very much hope that you will help us to maintain our culture even at an accelerated pace of growth. We are very happy to be recognized among the best startups to work according to LinkedIn and Glassdoor, among the 10 most innovative startups by Forbes Brasil and also to be certified by Great Place to Work. Being part of Loggi must mean that you can be who you are - or want to be. We look for a more accessible country. Thus, we can say that respecting the needs of different people is our reason for existing. This is history, it is culture, it is respect. Important All Loggi jobs are also open to people with disabilities (PwD). This job description is written in English because we already have a technology office in Europe, and as we are hiring professionals from all over the world, you can have interactions with professionals who do not speak Portuguese. Essa descrição de vaga está escrita em Inglês porque nós já temos um escritório de tecnologia na Europa e, como estamos contratando profissionais de todo o mundo, você pode ter interações com profissionais que não falam Português. Let's go together?"},
{"title": "Software Dev Engineer I- Backend Dev", "company": "Swiggy", "location": "Bengaluru, Karnataka, India", "description": "About the Team* The Marketplace Fulfilment Team is responsible for the entire post order experience at Swiggy. The technology solutions built by Marketplace Fulfilment Platform (MFP) Team are at the heart of Swiggy’s ability to deliver food to Customers. These systems power and affect the entire journey of a customer’s order; from predicting SLAs for a given set of restaurants using AI models when the app is opened, to the time the order is delivered to the Customer’s doorstep. The team’s charter encompasses all aspects of order fulfilment &amp; logistics, from planning the delivery fleet within a city/zone by time of day, to sophisticated algorithms and ML models that assign orders within minutes, in order to deliver the order within a 30-45min time slot, while maximising utilisation and efficiency of the fleet, to monitoring the order and automating interventions to handle exceptional conditions. With Swiggy’s unparalleled hyperlocal density, our Maps and Data Sciences team leverage the travel time data of Delivery Partners currently delivering orders, joined with our historical data to enable the speed and compliance of predicted SLAs, in the face of varying traffic condition and item preparation times in different cities, zones and restaurants, and providing live tracking of the order status and driver journey to Customers. Visit our tech blogs to learn more about some the challenges we deal with: https://bytes.swiggy.com/the-swiggy-delivery-challenge-part-one-6a2abb4f82f6 https://bytes.swiggy.com/swiggy-distance-service-9868dcf613f4 https://bytes.swiggy.com/the-tech-that-brings-you-your-food-1a7926229886 What Challenges would you get to work On? Logistics (Serviceability, Assignment, Simulation)- Or Driver Experience (Driver Acquisition &amp; On-boarding, Driver Retention &amp; Pay-outs, Fleet Planning) or CRM (Agent Workbench, Customer Touchpoint Automation, Live Tracking Screen) What do we look for? Good problem-solving skills Strong technical aptitude and good knowledge of CS fundamentals Sound knowledge and application of algorithms and data structures with space and time complexities Good knowledge of object-oriented programming with proficiency in at least one programming language like Java, Golang, Python etc Follow industry coding standards and responsible for writing maintainable/scalable/efficient code to solve business problems Hands-on experience of working with Databases and Linux/Unix platform B Tech/M Tech in Computer Science or equivalent from a reputed college Minimum 0.6 years of Experience in Product Development Company About Swiggy Founded in 2014, Swiggy is India’s leading on-demand delivery platform with a vision to elevate the quality of life for the urban consumer by oﬀering unparalleled convenience — through services like Food Delivery, Swiggy Stores, Swiggy Genie, Culinary Businesses such as Access, Brandworks and Private Brands. The platform connects consumers to over 1,60,000 Restaurant Partners across 520+ Cities. Using innovative technology and deep consumer insights, Swiggy is committed to provide a hassle-free, fast and reliable delivery experience. Every order delivered by Swiggy’s ﬂeet of 2.4 lakh + active Delivery Partners — the largest in India ensures a host of customer-centric features like lightning-fast delivery, no minimum order value, live order tracking, and 24/7 customer support, to name a few."},
{"title": "Software Engineer, Backend", "company": "Slack", "location": "Toronto, Ontario, Canada", "description": "Software Engineer, Backend Slack is looking for Backend Engineers to build features, design and implement API methods, and improve the performance and reliability of our systems as we rapidly scale our product and organization. We build our app using reliable tools that our team knows and trusts, including PHP/Hack, Java, MySQL, and Linux. Expertise in these areas is a huge plus, but having familiarity with other common web languages (such as Python or Ruby) and other relational databases are fine substitutes. We’re a collaborative team who genuinely enjoys working together with a cross-functional team of product managers, designers, frontend, iOS, Android, automation, and quality engineers to make Slack a better product. We are looking for engineers that understand that simplicity and reliability are aspects of a system to be carefully calculated with every decision made. A Taste Of Our Scale And Reach Users spend over 10 hours connected and 2+ hours active in Slack every work day. 10M+ Daily Active Users in more than 150 countries. 1.5 billion messages are sent per month, half of those outside the United States. Every day we see over 3.5 million simultaneously connected users, over 3.5 billion web requests, over 42 billion database queries per day, and our systems see over 1 million queries/second in our caching tier. We have 8.8M+ app installations with 155,000 weekly active developers building on the developer platform. 90% of our paid teams on Slack actively use apps. Slack has a positive, diverse, and supportive culture—we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking and, above all, collaborative. If this sounds like a good fit for you, why not say hello? What You Will Be Doing You'll brainstorm with Product Managers, Designers, Backend, and Frontend Engineers on your team to conceptualize and build new features for our large (and growing!) user base. You’ll produce high-quality results by contributing heavily to team projects that have a significant impact on the business. You’ll actively own team features or systems and define their long-term health, while also improving the health of surrounding systems. You'll assist our skilled support team and operations team in triaging and resolving production issues. You'll mentor other engineers and deeply review code. You’ll improve engineering standards, tooling, and processes What You Should Have You’ve been building web applications professionally for 2+ years. You have experience with functional or imperative programming languages -- e.g., PHP, Python, Ruby, Go, C, or Java. You can contribute to technical architecture discussions and help drive technical decisions within your team. You write understandable, testable code with an eye towards maintainability. You are a strong communicator. Explaining complex technical concepts to designers, support, and other engineers is no problem for you. You possess strong computer science fundamentals: data structures, algorithms, programming languages, distributed systems, and information retrieval. You have completed a bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience. Slack has transformed business communication. It’s the leading channel-based messaging platform, used by millions to align their teams, unify their systems, and drive their businesses forward. Only Slack offers a secure, enterprise-grade environment that can scale with the largest companies in the world. It is a new layer of the business technology stack where people can work together more effectively, connect all their other software tools and services, and find the information they need to do their best work. Slack is where work happens. Ensuring a diverse and inclusive workplace where we learn from each other is core to Slack’s values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a pleasant and supportive place to work. Come do the best work of your life here at Slack."},
{"title": "Software Engineer- Data Platform", "company": "Twitter", "location": "Bengaluru, Karnataka, India", "description": "Company Description Twitter serves the public conversation because conversation is a force for good in the world. The opportunity to help the world connect, debate, learn, and solve problems is what draws us to careers at Twitter, and it’s what keeps us here. Job Description Who We Are As engineers on the Data Platform team, our mission is to build the fastest, most reliable, and largest-scale data processing technologies in the world - able to cope with ever-increasing volumes of data in real-time - and then apply them to the company’s most critical and fundamental data problems. As a member of the team, you will be the “source of truth” for Twitter’s most fundamental data - such as Tweet content, engagement data, and user relationships - along with core metrics such as daily and monthly active users. You will surface these datasets in real-time to mission-critical products and business applications throughout the company. You will empower dozens of engineering teams, hundreds of co-workers, and millions of users to dream of new insights and new possibilities. What You’ll Do If this sounds like a team you want to be a part of, fantastic! We are looking for experienced engineers who love writing code, data engineering, understanding our customers, and collaborating with teammates to ship useful software. Sample projects we’ve built Real-time aggregations of interactions on tweets at ~5M/sec scale Unify our batch processing pipelines that count and validate user activity Use hidden Markov modeling to categorize users’ tweeting states Who You Are You take satisfaction in building resilient, performant, and thoroughly tested distributed systems that can power the most business-critical applications. You get stuff done and thrive in a small group environment. You have a strong sense of ownership and a curiosity to understand how things work, even if they take you outside your area of expertise. You welcome feedback on are constantly looking for ways to improve yourself."},
{"title": "Graduate Software Engineer", "company": "Dell", "location": "Haifa, Haifa, Israel", "description": "Software Engineer Join us as a software engineer on our Powerflex engineering team in Israel to do the best work of your career and make a profound social impact. What You’ll Achieve As a software engineer you will be responsible for developing cutting edge software while providing creative solutions based on our business needs. You Will Work with top tier customers on a high-performance software defined distributed storage product Design, develop, test, and integrate code for new or existing software Review and implement test strategies for software products Troubleshoot software reliability and performance issues Drive idea generation for new software products or for the next version of an existing product Currently work remotely from home and return to hybrid/full working from the office (Haifa/Herzliya-Glil Yam) in the future. Essential Requirements Bachelor's degree in computer science or electrical engineering Personally - Team player, highly motivated, methodical approach Desirable Requirements Knowledge in C/C++, operating systems and algorithms, software architectures and application, understanding of hardware and software interactions 0-2 years of Hands on experience with one or more of the following: storage, device drivers, databases, networking, embedded software/firmware development, Linux **please share your grades sheet** Here’s our story; now tell us yours Dell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress. What’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more. We started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today. You can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here. Application closing date: 01 June 2021 Dell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here. #LIPriority Job Id: R072249Job Function: Engineering Development"}
]